-- phpMyAdmin SQL Dump
-- version 2.10.3
-- http://www.phpmyadmin.net
-- 
-- 主机: localhost
-- 生成日期: 2016 年 12 月 01 日 02:08
-- 服务器版本: 5.0.51
-- PHP 版本: 5.2.6

SET SQL_MODE="NO_AUTO_VALUE_ON_ZERO";

-- 
-- 数据库: `ipms_patent`
-- 

-- --------------------------------------------------------

-- 
-- 表的结构 `ipms_attachment`
-- 

DROP TABLE IF EXISTS `ipms_attachment`;
CREATE TABLE IF NOT EXISTS `ipms_attachment` (
  `att_id` smallint(6) NOT NULL auto_increment,
  `att_name` char(255) NOT NULL COMMENT '真实的文件名',
  `att_name_display` char(255) NOT NULL COMMENT '页面显示的文件名',
  `uid` smallint(6) NOT NULL,
  `username` char(255) NOT NULL,
  `gid` smallint(6) NOT NULL,
  `role` char(50) NOT NULL,
  `obj_type` char(10) NOT NULL COMMENT '附件所属知识产权类型',
  `obj_id` smallint(6) NOT NULL COMMENT '附件所属知识产权id',
  `upload_date` datetime NOT NULL,
  PRIMARY KEY  (`att_id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=82 ;

-- 
-- 导出表中的数据 `ipms_attachment`
-- 

INSERT INTO `ipms_attachment` VALUES (5, '20160721234715_239.pdf', '审核人上传文件', 16, 'hy052', 2, '审核人', 'patent', 29, '2016-07-21 23:47:15');
INSERT INTO `ipms_attachment` VALUES (6, '20160729112440_408.docx', '撰写人上传文件', 15, 'hy052', 4, '撰写人', 'patent', 63, '2016-07-29 11:24:40');
INSERT INTO `ipms_attachment` VALUES (8, '20160729163153_827.docx', '审核人上传文件', 16, 'hy052', 2, '审核人', 'patent', 63, '2016-07-29 16:31:53');
INSERT INTO `ipms_attachment` VALUES (9, '20160812100803_462.jpg', '撰写人上传文件', 14, 'qxy112', 4, '撰写人', 'patent', 64, '2016-08-12 10:08:03');
INSERT INTO `ipms_attachment` VALUES (10, '20160822124624_861.pdf', '撰写人上传文件', 15, 'hy052', 4, '撰写人', 'patent', 66, '2016-08-22 12:46:24');
INSERT INTO `ipms_attachment` VALUES (11, '20160824134348_394.jpg', '撰写人上传文件', 15, 'hy052', 4, '撰写人', 'patent', 0, '2016-08-24 13:43:48');
INSERT INTO `ipms_attachment` VALUES (13, '20160824134858_491.jpg', '撰写人上传文件', 15, 'hy052', 4, '撰写人', 'patent', 0, '2016-08-24 13:48:58');
INSERT INTO `ipms_attachment` VALUES (14, '20160824142956_529.doc', '撰写人上传文件', 15, 'hy052', 4, '撰写人', 'patent', 0, '2016-08-24 14:29:56');
INSERT INTO `ipms_attachment` VALUES (15, '20160824143928_663.doc', '撰写人上传文件', 15, 'hy052', 4, '撰写人', 'patent', 76, '2016-08-24 14:39:28');
INSERT INTO `ipms_attachment` VALUES (80, '20160902195856_814.pdf', '撰写人上传文件', 15, 'hy052', 4, '撰写人', 'thesis', 5, '2016-09-02 19:58:56');

-- --------------------------------------------------------

-- 
-- 表的结构 `ipms_hyuser`
-- 

DROP TABLE IF EXISTS `ipms_hyuser`;
CREATE TABLE IF NOT EXISTS `ipms_hyuser` (
  `userid` int(11) unsigned NOT NULL auto_increment,
  `gid` smallint(4) unsigned NOT NULL,
  `username` varchar(20) NOT NULL default '',
  `userpwd` varchar(40) NOT NULL default '',
  `regdate` date NOT NULL,
  `disable` smallint(3) unsigned NOT NULL default '0',
  `dept` varchar(50) NOT NULL default '光机电',
  PRIMARY KEY  (`userid`),
  KEY `user_gid` (`gid`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=28 ;

-- 
-- 导出表中的数据 `ipms_hyuser`
-- 

INSERT INTO `ipms_hyuser` VALUES (1, 1, 'admin', 'e10adc3949ba59abbe56e057f20f883e', '2016-01-05', 0, '光机电');
INSERT INTO `ipms_hyuser` VALUES (2, 4, '写1', 'e10adc3949ba59abbe56e057f20f883e', '2016-01-06', 0, 'JC1');
INSERT INTO `ipms_hyuser` VALUES (3, 4, '写2', 'e10adc3949ba59abbe56e057f20f883e', '2016-01-05', 0, 'RD2');
INSERT INTO `ipms_hyuser` VALUES (5, 3, 'CTO', 'e10adc3949ba59abbe56e057f20f883e', '2016-01-05', 0, '总工');
INSERT INTO `ipms_hyuser` VALUES (4, 2, '审1', 'e10adc3949ba59abbe56e057f20f883e', '2015-02-20', 0, '光机电');
INSERT INTO `ipms_hyuser` VALUES (6, 4, '写3', 'e10adc3949ba59abbe56e057f20f883e', '0000-00-00', 0, '光机电');
INSERT INTO `ipms_hyuser` VALUES (7, 4, 'CTO', 'e10adc3949ba59abbe56e057f20f883e', '0000-00-00', 0, '总工');
INSERT INTO `ipms_hyuser` VALUES (8, 2, 'CTO', 'e10adc3949ba59abbe56e057f20f883e', '0000-00-00', 1, '总工');
INSERT INTO `ipms_hyuser` VALUES (9, 7, 'clc018', 'e10adc3949ba59abbe56e057f20f883e', '0000-00-00', 0, '计划部');
INSERT INTO `ipms_hyuser` VALUES (10, 7, 'qxy112', 'e10adc3949ba59abbe56e057f20f883e', '0000-00-00', 0, '计划部');
INSERT INTO `ipms_hyuser` VALUES (11, 4, 'clc018', 'e10adc3949ba59abbe56e057f20f883e', '0000-00-00', 0, '计划部');
INSERT INTO `ipms_hyuser` VALUES (12, 1, 'clc018', 'e10adc3949ba59abbe56e057f20f883e', '0000-00-00', 0, '计划部');
INSERT INTO `ipms_hyuser` VALUES (22, 1, 'qxy112', 'e10adc3949ba59abbe56e057f20f883e', '0000-00-00', 0, '计划部');
INSERT INTO `ipms_hyuser` VALUES (14, 4, 'qxy112', 'e10adc3949ba59abbe56e057f20f883e', '0000-00-00', 0, '计划部');
INSERT INTO `ipms_hyuser` VALUES (15, 4, 'hy052', 'e10adc3949ba59abbe56e057f20f883e', '0000-00-00', 0, '计划部');
INSERT INTO `ipms_hyuser` VALUES (16, 2, 'hy052', 'e10adc3949ba59abbe56e057f20f883e', '0000-00-00', 0, '计划部');
INSERT INTO `ipms_hyuser` VALUES (17, 3, 'hy052', 'e10adc3949ba59abbe56e057f20f883e', '0000-00-00', 0, '计划部');
INSERT INTO `ipms_hyuser` VALUES (18, 7, 'hy052', 'e10adc3949ba59abbe56e057f20f883e', '0000-00-00', 0, '计划部');
INSERT INTO `ipms_hyuser` VALUES (19, 2, 'xyf', 'e10adc3949ba59abbe56e057f20f883e', '0000-00-00', 0, '计划部');
INSERT INTO `ipms_hyuser` VALUES (20, 2, 'clc018', 'e10adc3949ba59abbe56e057f20f883e', '0000-00-00', 0, '计划部');
INSERT INTO `ipms_hyuser` VALUES (21, 2, 'qxy112', 'e10adc3949ba59abbe56e057f20f883e', '0000-00-00', 0, '计划部');
INSERT INTO `ipms_hyuser` VALUES (23, 7, '冼云帆', 'e10adc3949ba59abbe56e057f20f883e', '0000-00-00', 0, '计划部');
INSERT INTO `ipms_hyuser` VALUES (24, 3, '梁锡辉', 'e10adc3949ba59abbe56e057f20f883e', '0000-00-00', 0, '光机电');
INSERT INTO `ipms_hyuser` VALUES (25, 4, '梁锡辉', 'e10adc3949ba59abbe56e057f20f883e', '0000-00-00', 0, '光机电');
INSERT INTO `ipms_hyuser` VALUES (26, 4, '朱倩', 'e10adc3949ba59abbe56e057f20f883e', '0000-00-00', 0, '计划部');
INSERT INTO `ipms_hyuser` VALUES (27, 3, '朱倩', 'e10adc3949ba59abbe56e057f20f883e', '0000-00-00', 0, '计划部');

-- --------------------------------------------------------

-- 
-- 表的结构 `ipms_patent`
-- 

DROP TABLE IF EXISTS `ipms_patent`;
CREATE TABLE IF NOT EXISTS `ipms_patent` (
  `pat_id` smallint(6) NOT NULL auto_increment,
  `pattopic` char(255) default NULL,
  `pattype` char(255) default NULL,
  `status` char(255) default NULL,
  `owner` char(255) default NULL,
  `author` char(255) default NULL,
  `uid` smallint(6) default NULL,
  `writer` char(255) NOT NULL default '*' COMMENT '撰写人',
  `authorother` char(255) NOT NULL default '无',
  `applynumber` char(255) default NULL,
  `approvenumber` int(11) default NULL,
  `patagency` char(255) default NULL,
  `adddate` date NOT NULL default '0000-00-00' COMMENT '院内填报日期',
  `submitdate` date NOT NULL default '0000-00-00' COMMENT '院内提交日期',
  `auditdate` date NOT NULL default '0000-00-00' COMMENT '院内审核日期',
  `approvedate` date NOT NULL default '0000-00-00' COMMENT '院内批准日期',
  `mod_retdate` date NOT NULL default '0000-00-00' COMMENT '修改/退回日期',
  `apply_abandondate` date NOT NULL default '0000-00-00' COMMENT '申报/放弃日期',
  `lic_rejdate` date NOT NULL default '0000-00-00' COMMENT '授权/驳回日期',
  `renewdate` date NOT NULL default '0000-00-00' COMMENT '续费日期',
  `dept` char(255) default NULL,
  `keyword` char(255) default NULL,
  `summary` text,
  `applyplace` char(255) default NULL,
  `prjnum` varchar(255) default NULL,
  `prjtopic` varchar(255) default NULL,
  `attachment` text COMMENT '上传附件文件名',
  PRIMARY KEY  (`pat_id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COMMENT='专利' AUTO_INCREMENT=72 ;

-- 
-- 导出表中的数据 `ipms_patent`
-- 

INSERT INTO `ipms_patent` VALUES (1, '核酸自动提取机', '发明专利', '维护', 'GZOME', '王朝中', 0, '*', '行联合、范小璧、梁旭明、黄政杰、程在学、袁惠萍、廖志明、程钢、王芳', 'ZL 03 1 13637.0', 0, '*', '2002-10-22', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '2003-01-22', '2005-12-14', '2016-01-13', '*', '*', '*', '中国大陆', '*', '*', '*');
INSERT INTO `ipms_patent` VALUES (2, '葡萄糖6-磷酸脱氢酶和地中海贫血自动分析仪', '发明专利', '维护', 'GZOME', '王  芳', 0, '*', '范小璧、廖志明、魏德仙、黄政杰、程在学、袁惠萍', 'ZL 03 1 13638.9', 0, '*', '2002-10-22', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '2003-01-22', '2008-04-16', '2016-01-13', '*', '*', '*', '中国大陆', '*', '*', '*');
INSERT INTO `ipms_patent` VALUES (3, '一种移动式防空防灾电声警报器', '发明专利', '授权', 'GZOME', '任豪', 0, '*', '毕君、朱保礼、罗宇强、何晓波', 'ZL 200610036135.9', 0, '*', '2002-10-22', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '2006-06-29', '2010-01-13', '0000-00-00', '*', '*', '*', '中国大陆', '*', '*', '*');
INSERT INTO `ipms_patent` VALUES (4, 'LED光源综合发光特性连续检测装置', '发明专利', '授权', 'GZOME', '任豪', 0, '*', '罗宇强、李康业、王巧彬', '2008 1 0027726.9', 0, '*', '2002-10-22', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '2008-04-28', '2011-06-29', '0000-00-00', '*', '*', '*', '中国大陆', '*', '*', '*');
INSERT INTO `ipms_patent` VALUES (5, '用于真空镀膜的水平方向公自转运动机构', '发明专利', '授权', 'GZOME', '卫红', 0, '*', '刘志宇、曹一鸣、黄涌、王小辉', '2009 10213992.5', 0, '*', '2002-10-22', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '2009-12-18', '2011-11-16', '0000-00-00', '*', '*', '*', '中国大陆', '*', '*', '*');
INSERT INTO `ipms_patent` VALUES (6, '一种薄箱式高尔夫自动供球机', '发明专利', '维护', 'GZOME', '任豪', 0, '*', '李康业、程在学、程剑钊', '2010 1 0118132.6', 0, '*', '2002-10-22', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '2010-02-02', '2011-08-24', '2016-01-13', '*', '*', '*', '中国大陆', '*', '*', '*');
INSERT INTO `ipms_patent` VALUES (7, '一种传球装置', '发明专利', '维护', 'GZOME', '李康业', 0, '*', '任豪、程在学、吴伟钳', '2010 1 115199.4', 0, '*', '2002-10-22', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '2010-02-02', '2011-08-24', '2016-01-13', '*', '*', '*', '中国大陆', '*', '*', '*');
INSERT INTO `ipms_patent` VALUES (8, '一种出球装置', '发明专利', '维护', 'GZOME', '李康业', 0, '*', '任豪、程在学、梁旭明、陈远靖', '2010 1 0115212.6', 0, '*', '2002-10-22', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '2010-02-02', '2012-08-22', '2016-01-13', '*', '*', '*', '中国大陆', '*', '*', '*');
INSERT INTO `ipms_patent` VALUES (9, '一种间歇性光照度检测装置', '发明专利', '授权', 'GZOME', '李康业', 0, '*', '任豪、吴伟钳、王巧彬', '2010 1 02883080.5', 0, '*', '2002-10-22', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '2010-09-17', '2013-05-22', '0000-00-00', '*', '*', '*', '中国大陆', '*', '*', '*');
INSERT INTO `ipms_patent` VALUES (10, '用于激光透射焊接塑料材料的焊接装置及其焊接方法', '发明专利', '维护', 'GZOME', '庞振华', 0, '*', '宋杰、赵博、梁锡辉', '2011 1 0109966.5', 0, '*', '2002-10-22', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '2011-04-29', '2013-03-20', '2016-04-29', '*', '*', '*', '中国大陆', '*', '*', '*');
INSERT INTO `ipms_patent` VALUES (11, '一种自动测试分筛系统', '发明专利', '授权', 'GZOME', '曹一鸣', 0, '*', '黄作宏、卫红、刘志宇、周鸿飞、陈霞', '2011 1 122201.5', 0, '*', '2002-10-22', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '2011-05-12', '2012-11-07', '0000-00-00', '*', '*', '*', '中国大陆', '*', '*', '*');
INSERT INTO `ipms_patent` VALUES (12, '一种恒温空气浴装置及其对控温器检测、老化测试方法', '发明专利', '授权', 'GZOME', '王芳', 0, '*', '罗宇强、梁旭明、赖顺桥、邓向阳、翁纪钊、程在学', '2011 1 0390894.6', 0, '*', '2002-10-22', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '2011-11-30', '2014-04-16', '0000-00-00', '*', '*', '*', '中国大陆', '*', '*', '*');
INSERT INTO `ipms_patent` VALUES (13, '温控器测试装置及其对温控器校正测试、老化测试方法', '发明专利', '授权', 'GZOME', '罗宇强', 0, '*', '梁旭明、王芳、赖顺桥、邓向阳、翁纪钊、程在学', '2011 1 0391456.1', 0, '*', '2002-10-22', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '2011-11-30', '2014-04-16', '0000-00-00', '*', '*', '*', '中国大陆', '*', '*', '*');
INSERT INTO `ipms_patent` VALUES (14, '多灯具在线自动综合测试系统及方法', '发明专利', '授权', 'GZOME', '蔡俊涛', 0, '*', '任豪、翁纪钊、张沛强', '2013 1 0344703.1', 0, '*', '2002-10-22', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '2013-08-08', '2015-10-07', '0000-00-00', '*', '*', '*', '中国大陆;"*', '*', '*', '\r\n');
INSERT INTO `ipms_patent` VALUES (15, '一种用于智能自助发票销售税务终端机张式发票传票机芯', '发明专利', '授权', 'GZOME', '罗宇强', 0, '*', '高燕祥、张沛强、王芳、曹仙春、凌磊、陈龙、黄普迅、李长春', '2013 1 0703604.8', 0, '*', '2002-10-22', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '2013-12-18', '2016-01-27', '0000-00-00', '*', '*', '*', '中国大陆;"*', '*', '*', '\r\n');
INSERT INTO `ipms_patent` VALUES (16, '立体投影箱', '实用新型专利', '授权', 'GZOME', '符平', 0, '*', '任豪、朱平、吕思繁', 'ZL 99 2 1093.2', 0, '*', '2002-10-22', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '1999-12-17', '2000-09-05', '0000-00-00', '*', '*', '*', '中国大陆;"*', '*', '*', '');
INSERT INTO `ipms_patent` VALUES (17, '太阳能生态音频机场驱鸟器', '实用新型专利', '授权', 'GZOME', '任豪', 0, '*', '郭文志、朱保礼、毕君、骆超艺、郑福美、蔡俊涛、李鸿、刘雪芳', 'ZL 2007 2 0054792.6', 0, '*', '2002-10-22', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '2007-07-30', '2009-02-25', '0000-00-00', '*', '*', '*', '中国大陆;"*', '*', '*', '');
INSERT INTO `ipms_patent` VALUES (18, '一种LED光源光强空间分布特性测试装置', '实用新型专利', '授权', 'GZOME', '任豪', 0, '*', '李康业、王巧彬、胡敏', 'ZL 2008 2 0046804.5', 0, '*', '2002-10-22', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '2008-01-01', '2009-01-21', '0000-00-00', '*', '*', '*', '中国大陆;"*', '*', '*', '');
INSERT INTO `ipms_patent` VALUES (19, '一种复合光路宽光谱膜厚监控装置', '实用新型专利', '授权', 'GZOME', '任豪', 0, '*', '罗宇强、王巧彬', 'ZL 2008 2 0046805.X', 0, '*', '2002-10-22', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '2008-01-01', '2008-04-29', '0000-00-00', '*', '*', '*', '中国大陆;"*', '*', '*', '');
INSERT INTO `ipms_patent` VALUES (20, 'LED光纤照明灯', '实用新型专利', '授权', 'GZOME', '任豪', 0, '*', '范力维、章书敏、邓向阳', 'ZL 2008 2 0046975.8', 0, '*', '2002-10-22', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '2008-04-28', '2009-01-21', '0000-00-00', '*', '*', '*', '中国大陆;"*', '*', '*', '');
INSERT INTO `ipms_patent` VALUES (21, '银行复点机', '实用新型专利', '授权', 'GZOME', '麦静惠', 0, '*', '麦静惠', 'ZL 2008 2 0048165.6', 0, '*', '2002-10-22', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '2008-05-23', '2009-02-25', '0000-00-00', '*', '*', '*', '中国大陆;"*', '*', '*', '');
INSERT INTO `ipms_patent` VALUES (22, '一种复点机电控系统', '实用新型专利', '授权', 'GZOME', '麦静惠', 0, '*', '麦静惠', 'ZL 2008 2 0048166.0', 0, '*', '2002-10-22', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '2008-05-23', '2009-02-25', '0000-00-00', '*', '*', '*', '中国大陆;"*', '*', '*', '');
INSERT INTO `ipms_patent` VALUES (23, '一种恒温积分球装置', '实用新型专利', '授权', 'GZOME', '任豪', 0, '*', '李康业', '2010 2 0546670.0', 0, '*', '2002-10-22', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '2010-09-28', '2011-05-18', '0000-00-00', '*', '*', '*', '中国大陆;"*', '*', '*', '');
INSERT INTO `ipms_patent` VALUES (24, '一种光束局部变化装置', '实用新型专利', '授权', 'GZOME', '李康业', 0, '*', '任豪、范力维', '2010 2 0549231.5', 0, '*', '2002-10-22', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '2010-09-29', '2011-06-29', '0000-00-00', '*', '*', '*', '中国大陆;"*', '*', '*', '');
INSERT INTO `ipms_patent` VALUES (25, '用于激光透射焊接塑料材料的焊接装置', '实用新型专利', '维护', 'GZOME', '庞振华', 0, '*', '宋杰、赵博、梁锡辉', '2011 2 0132653.7', 0, '*', '2002-10-22', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '2011-04-29', '2011-09-28', '2016-09-02', '*', '*', '*', '中国大陆;', '*', '*', '');
INSERT INTO `ipms_patent` VALUES (26, '一种用于冲击试验机的高度控制装置', '实用新型专利', '授权', 'GZOME', '卢俊杰', 0, '*', '罗益绵、吴巍、林青、杨春生', '2011 2 0462859.6', 0, '*', '2002-10-22', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '2011-11-18', '2012-07-11', '0000-00-00', '*', '*', '*', '中国大陆;"*', '*', '*', '');
INSERT INTO `ipms_patent` VALUES (27, '一种用于冲击试验机的碎片收集和防护装置', '实用新型专利', '授权', 'GZOME', '罗益绵', 0, '*', '卢俊杰、吴巍、林青、杨春生', '2011 2 0462916.0', 0, '*', '2002-10-22', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '2011-11-18', '2012-07-11', '0000-00-00', '*', '*', '*', '中国大陆;"*', '*', '*', '');
INSERT INTO `ipms_patent` VALUES (28, '温控器测试装置', '实用新型专利', '授权', 'GZOME', '罗宇强', 0, '*', '梁旭明、王芳、赖顺桥、邓向阳、翁纪钊、程在学', '2011 2 0490664.2', 0, '*', '2002-10-22', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '2011-11-30', '2012-09-19', '0000-00-00', '*', '*', '*', '中国大陆;"*', '*', '*', '');
INSERT INTO `ipms_patent` VALUES (29, '一种用于柴油机活塞环槽的激光热处理装置', '实用新型专利', '维护', 'GZOME', '庞振华', 0, '*', '潘瑞娟、宋杰', '2012 2 0014594.8', 0, '*', '2002-10-22', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '2011-01-12', '2012-09-05', '2016-01-12', '*', '*', '*', '中国大陆;"*', '*', '*', '');
INSERT INTO `ipms_patent` VALUES (30, '一种用于核酸自动提取机的加热分离装置', '实用新型专利', '维护', 'GZOME', '王芳', 0, '*', '赵博、邓向阳、翁纪钊', '2012 2 0014593.3', 0, '*', '2002-10-22', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '2012-01-12', '2012-09-19', '2016-01-12', '*', '*', '*', '中国大陆;"*', '*', '*', '');
INSERT INTO `ipms_patent` VALUES (31, '一种工件翻转传输装置', '实用新型专利', '授权', 'GZOME', '严卫聪', 0, '*', '刘雪芳、李长春、林镇杰、彭诗然', '2013 2 0480416.9', 0, '*', '2002-10-22', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '2013-08-07', '2014-02-12', '0000-00-00', '*', '*', '*', '中国大陆;"*', '*', '*', '');
INSERT INTO `ipms_patent` VALUES (32, '一种智能化射频识别检测装置', '实用新型专利', '授权', 'GZOME', '林镇杰', 0, '*', '翁纪钊、刘雪芳、严卫聪、孟俊杰', '2013 2 0482460.3', 0, '*', '2002-10-22', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '2013-08-07', '2014-01-15', '0000-00-00', '*', '*', '*', '中国大陆;"*', '*', '*', '');
INSERT INTO `ipms_patent` VALUES (33, '一种多通道LED灯具电参数监测装置', '实用新型专利', '授权', 'GZOME', '张沛强', 0, '*', '蔡俊涛', '2013 2 0482483.4', 0, '*', '2002-10-22', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '2013-08-07', '2014-01-15', '0000-00-00', '*', '*', '*', '中国大陆;"*', '*', '*', '');
INSERT INTO `ipms_patent` VALUES (34, '一种防眩光反射镜', '实用新型专利', '授权', 'GZOME', '刘志宇', 0, '*', '卫红、曹一鸣、莫忠、陈霞', '2014 2 0405930.0', 0, '*', '2002-10-22', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '2014-07-22', '2016-09-05', '0000-00-00', '*', '*', '*', '中国大陆;', '*', '*', '');
INSERT INTO `ipms_patent` VALUES (35, '一种高清摄像机综合特性检测装置及检测方法', '实用新型专利', '授权', 'GZOME', '罗宇强', 0, '*', '冯加模、李康业、曹仙春、翁纪钊、陈龙、胡锦添', '2014 2 0616693.2', 0, '*', '2002-10-22', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '2014-10-23', '2016-09-02', '0000-00-00', '*', '*', '*', '港澳台', '*', '*', '');
INSERT INTO `ipms_patent` VALUES (36, '一种用于视频设备的透雾功能测试系统', '实用新型专利', '授权', 'GZOME', '罗宇强', 0, '*', '冯加模、赵博、程剑钊、张沛强、陈龙、刘泽腾', '2014 2 0618695.5', 0, '*', '2002-10-22', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '2014-10-23', '2015-02-18', '0000-00-00', '*', '*', '*', '中国大陆;"*', '*', '*', '');
INSERT INTO `ipms_patent` VALUES (37, '一种LED显示屏现场测试装置', '实用新型专利', '授权', 'GZOME', '王巧彬', 0, '*', '任豪、翁纪钊、高军翔', '2015 2 0814892.9', 0, '*', '2002-10-22', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '2015-10-20', '2016-02-24', '0000-00-00', '*', '*', '*', '中国大陆;"*', '*', '*', '');
INSERT INTO `ipms_patent` VALUES (38, '一种道路照明灯具现场测试系统', '实用新型专利', '授权', 'GZOME', '任豪', 0, '*', '王巧彬、张沛强、李康业、何明佳', '2015 2 0817089', 0, '*', '2002-10-22', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '2015-10-20', '2016-05-11', '0000-00-00', '*', '*', '*', '中国大陆;"*', '*', '*', '');
INSERT INTO `ipms_patent` VALUES (39, '一种基于组合光谱的LED农业照明系统', '实用新型专利', '授权', 'GZOME', '王巧彬', 0, '*', '任豪、高军翔、何志宏、胡毅帆', '2015 2 0830334.1', 0, '*', '2002-10-22', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '2015-10-20', '2016-02-24', '0000-00-00', '*', '*', '*', '中国大陆;"*', '*', '*', '');
INSERT INTO `ipms_patent` VALUES (40, '一种加装可调式遮光筒的光度测试装置', '实用新型专利', '授权', 'GZOME', '王巧彬', 0, '*', '任豪、翁纪钊、胡毅帆', '2015 2 0901293', 0, '*', '2002-10-22', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '2015-11-12', '2016-04-06', '0000-00-00', '*', '*', '*', '中国大陆;"*', '*', '*', '');
INSERT INTO `ipms_patent` VALUES (41, '压铸机压铸质量实时诊断装置软件V1.0', '软件版权', '授权', 'GZOME', '*', 0, '*', '软著登字第131969号', '软著登字第131969号', 0, '2002-10-22', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '2008-12-03', '2009-02-16', '0000-00-00', '0000-00-00', '*', '*', '中国大陆;"*', '*', '*', '', NULL);
INSERT INTO `ipms_patent` VALUES (42, '物流车辆智能调度管理系统', '软件版权', '授权', 'GZOME', '*', 0, '*', '软著登字第0180900号', '软著登字第0180900号', 0, '2002-10-22', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '2009-06-25', '2009-11-19', '0000-00-00', '0000-00-00', '*', '*', '中国大陆;"*', '*', '*', '', NULL);
INSERT INTO `ipms_patent` VALUES (43, '智能枪支安全管理系统', '软件版权', '授权', 'GZOME', '*', 0, '*', '2009SR038401', '软著登字第0165400号;"*', 2002, '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '2009-06-29', '2009-09-10', '0000-00-00', '0000-00-00', '0000-00-00', '*', '中国大陆;"*', '*', '*', '', NULL, NULL);
INSERT INTO `ipms_patent` VALUES (44, '温控器测试仪软件', '软件版权', '授权', 'GZOME', '梁旭明', 0, '*', '赖顺桥', '2012SR029455', 0, '*', '2002-10-22', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '2011-01-17', '2012-04-16', '0000-00-00', '*', '*', '*', '中国大陆;"*', '*', '*', '\r\n');
INSERT INTO `ipms_patent` VALUES (45, '气流式荧光定量PCR测定仪软件', '软件版权', '驳回', 'GZOME', '梁旭明', 0, '*', '赖顺桥', '*', 0, '*', '2002-10-22', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '2011-01-17', '2016-09-02', '0000-00-00', '*', '*', '*', '美日欧', 'sfddsafsa', '*', '');
INSERT INTO `ipms_patent` VALUES (46, 'LED照明智能管理系统', '软件版权', '授权', 'GZOME', '蔡俊涛', 0, '*', '张沛强、梁旭明、徐志雄', '2012SR029280', 0, '*', '2002-10-22', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '2011-04-14', '2012-04-16', '0000-00-00', '*', '*', '*', '中国大陆;"*', '*', '*', '\r\n');
INSERT INTO `ipms_patent` VALUES (47, '防空防灾警报器通讯控制软件', '软件版权', '授权', 'GZOME', '毕君', 0, '*', '蔡俊涛、任豪、刘雪芳、何晓波、潘俊峰、罗宇强、程剑钊、刘俊金', '2012SR029495', 0, '*', '2002-10-22', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '2011-04-14', '2012-04-16', '0000-00-00', '*', '*', '*', '中国大陆;"*', '*', '*', '\r\n');
INSERT INTO `ipms_patent` VALUES (48, '机场驱鸟设备控制系统软件', '软件版权', '授权', 'GZOME', '毕君', 0, '*', '蔡俊涛、任豪、刘雪芳、何晓波、潘俊峰、罗宇强、程剑钊、刘俊金', '2012SR029498', 0, '*', '2002-10-22', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '2011-04-14', '2012-04-16', '0000-00-00', '*', '*', '*', '中国大陆;"*', '*', '*', '\r\n');
INSERT INTO `ipms_patent` VALUES (49, '实时荧光定量PCR检测软件V1.0', '软件版权', '授权', 'GZOME', '*', 0, '*', '2012SR029457', '软著登字第0397493号', 0, '2002-10-22', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '2012-04-16', '0000-00-00', '0000-00-00', '*', '*', '中国大陆;"*', '*', '*', '', NULL);
INSERT INTO `ipms_patent` VALUES (50, 'LED老化测试系统', '软件版权', '授权', 'GZOME', '蔡俊涛', 0, '*', '张沛强', '2013SR129419', 0, '*', '2002-10-22', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '2013-08-07', '2013-11-20', '0000-00-00', '*', '*', '*', '中国大陆;"*', '*', '*', '\r\n');
INSERT INTO `ipms_patent` VALUES (51, '张式发票自动售卖机芯控制软件【简称：发票机芯控制软件】V1.0', '软件版权', '授权', 'GZOME', '张沛强', 0, '*', '罗宇强、陈龙', '2014SR040889', 0, '*', '2002-10-22', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '2014-02-18', '2014-04-10', '0000-00-00', '*', '*', '*', '中国大陆;"*', '*', '*', '\r\n');
INSERT INTO `ipms_patent` VALUES (52, '基于RFID的食品流通履历追溯系统【简称：食品流通履历追溯系统】V1.0', '软件版权', '授权', 'GZOME', '赖顺桥', 0, '*', '赖顺桥、刘宇、蔡俊涛、肖熠琳、胡锦添', '2014SR071397', 0, '*', '2002-10-22', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '2014-04-06', '2014-06-04', '0000-00-00', '*', '*', '*', '中国大陆;"*', '*', '*', '\r\n');
INSERT INTO `ipms_patent` VALUES (53, '智能化视频系统产品性能检测业务管理系统', '软件版权', '授权', 'GZOME', '蔡俊涛', 0, '*', '蔡俊涛、赖顺桥、肖熠琳、范力维', '2014SR144479', 0, '*', '2002-10-22', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '2014-08-14', '2014-09-25', '0000-00-00', '*', '*', '*', '中国大陆;"*', '*', '*', '\r\n');
INSERT INTO `ipms_patent` VALUES (54, '滤光片图像自动采集与信息获取软件V1.0', '软件版权', '授权', 'GZOME', '王小辉', 0, '*', '*', '2014SR182960', 0, '*', '2002-10-22', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '2014-10-08', '2014-11-28', '0000-00-00', '*', '*', '*', '中国大陆;"*', '*', '*', '\r\n');
INSERT INTO `ipms_patent` VALUES (55, '检验检测实验室业务流程管理系统【简称：检验业务管理系统V1.0】', '软件版权', '授权', 'GZOME', '蔡俊涛', 0, '*', '吴巍、钟宝麟、李天祥、王巧彬、范立维、黄玲珍、庞振华、谢树鑫、刘雪芳、孟俊杰、彭诗然', '2014SR217775', 0, '*', '2002-10-22', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '2014-12-31', '0000-00-00', '*', '*', '*', '中国大陆;"*', '*', '*', '\r\n');
INSERT INTO `ipms_patent` VALUES (56, 'LED道路照明智能管理系统V1.0', '软件版权', '授权', 'GZOME', '赖顺桥', 0, '*', '蔡俊涛、刘宇、肖熠琳', '2015SR046748', 0, '*', '2002-10-22', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '2016-09-05', '0000-00-00', '*', '*', '*', '中国大陆;', '*', '*', '\r\n');
INSERT INTO `ipms_patent` VALUES (57, '城轨道岔裂纹在线监测系统', '软件版权', '授权', 'GZOME', '胡锦添', 0, '*', '蔡俊涛、徐志雄、刘蓝轩、李康业', '2016SR099057', 0, '*', '2002-10-22', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '2016-09-05', '0000-00-00', '*', '*', '*', '中国大陆;', '*', '*', '\r\n');
INSERT INTO `ipms_patent` VALUES (58, '复点机', '外观设计专利', '授权', 'GZOME', '麦静惠', 0, '*', '', '*', 2008, 'ZL 2008 3 0048148.8', '0000-00-00', '2002-10-22', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '2008-05-08', '2009-07-22', '0000-00-00', '*', '*', '*', '中国大陆;"*', '*', '*');
INSERT INTO `ipms_patent` VALUES (59, '条形码指纹物品管理机', '外观设计专利', '维护', 'GZOME', '邓向阳', 0, '*', '肖熠琳、罗宇强、赖顺桥', '2011 3 0164648.X', 0, '*', '2002-10-22', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '2011-06-09', '2012-01-11', '2016-04-25', '*', '*', '*', '中国大陆;"*', '*', '*', '');
INSERT INTO `ipms_patent` VALUES (60, 'FRID RADIO BEE 吉祥宝宝', '著作权', '授权', 'GZOME', '*', 0, '*', '', '*', 0, '2011-F-050667', '0000-00-00', '2002-10-22', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '2011-01-15', '2011-12-20', '0000-00-00', '*', '*', '*', '中国大陆;"*', '*', '*');
INSERT INTO `ipms_patent` VALUES (61, '镭华标志', '著作权', '授权', 'GZOME', '叶惠兰', 0, '*', '', '*', 0, '国作登字-2012-F-0076639', '0000-00-00', '2002-10-22', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '2012-11-22', '0000-00-00', '*', '*', '*', '中国大陆;"*', '*', '*');
INSERT INTO `ipms_patent` VALUES (62, '银宝标志', '著作权', '授权', 'GZOME', '叶惠兰', 0, '*', '', '*', 0, '国作登字-2012-F-0076638', '0000-00-00', '2002-10-22', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '2012-11-23', '0000-00-00', '*', '*', '*', '中国大陆;"*', '*', '*');
INSERT INTO `ipms_patent` VALUES (63, '1', '实用新型专利', '申报', '1', '1', 15, 'hy052', '1', NULL, NULL, NULL, '2016-07-29', '2016-07-29', '2016-09-02', '2016-09-02', '0000-00-00', '2016-09-05', '0000-00-00', '0000-00-00', '计划部', '1', '1', '中国大陆', 'dsadsadsadsadsadsa', '1', '20160729163153_827.docx');
INSERT INTO `ipms_patent` VALUES (64, '2', '发明专利', '填报', 'GZOME', '2', 14, 'qxy112', '2', NULL, NULL, NULL, '2016-08-12', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '计划部', '2', '2', '中国大陆', 'XM2015003', '2', '20160812100803_462.jpg');
INSERT INTO `ipms_patent` VALUES (65, '3', '实用新型专利', '填报', 'GZOME', NULL, 15, 'hy052', '3', NULL, NULL, NULL, '2016-08-12', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '计划部', '3', '3', '港澳台', 'XM2015074', '3', NULL);
INSERT INTO `ipms_patent` VALUES (66, '44', '软件版权', '退回', 'GZOME', '4', 15, 'hy052', '44', NULL, NULL, NULL, '2016-08-17', '2016-09-05', '2016-09-05', '0000-00-00', '2016-09-05', '0000-00-00', '0000-00-00', '0000-00-00', '计划部', '4', '5555555', '中国大陆', 'XM2015074', '44', NULL);
INSERT INTO `ipms_patent` VALUES (67, 'wuwu', '发明专利', '申报', '广州市光机电技术研究院', 'wu', 15, 'hy052', '无', NULL, NULL, NULL, '2016-09-02', '2016-09-05', '2016-09-05', '2016-09-05', '0000-00-00', '2016-09-05', '0000-00-00', '0000-00-00', '计划部', 'fdsafdsad', 'dsafdsafdsafdsafdsafdfda', '中国大陆', 'fdsafd', 'fdfff', '20160902161439_291.doc');
INSERT INTO `ipms_patent` VALUES (68, 'wuwu', '实用新型专利', '提交', '广州市光机电技术研究院', 'wu', 15, 'hy052', '无', NULL, NULL, NULL, '2016-09-02', '2016-09-18', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '计划部', '大好大', ' fdsa ', '中国大陆', '大', 'd ', NULL);
INSERT INTO `ipms_patent` VALUES (69, '雷克萨斯', '发明专利', '填报', '雷克萨斯', ' 魂牵梦萦', 15, 'hy052', '无', NULL, NULL, NULL, '2016-09-02', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '计划部', ' 载', ' 载', '中国大陆', ' 载', ' 载 ', '20160914123901_319.docx');
INSERT INTO `ipms_patent` VALUES (70, '5', '实用新型专利', '填报', 'afs', 'fdsa', 15, 'hy052', '无', NULL, NULL, NULL, '2016-09-02', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '计划部', ' fa', 'fda ', '港澳台', ' fda', ' da ', NULL);
INSERT INTO `ipms_patent` VALUES (71, 'kk', '集成电路图', '填报', 'GZOME', 'kk', 15, 'hy052', '无', NULL, NULL, NULL, '2016-09-07', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '计划部', 'kk', 'kk', '中国大陆', 'XM2015033', 'kk', NULL);

-- --------------------------------------------------------

-- 
-- 表的结构 `ipms_process`
-- 

DROP TABLE IF EXISTS `ipms_process`;
CREATE TABLE IF NOT EXISTS `ipms_process` (
  `prcssid` smallint(6) NOT NULL auto_increment,
  `uid` smallint(6) NOT NULL,
  `gid` smallint(6) NOT NULL,
  `groupname` char(255) NOT NULL,
  `username` char(255) NOT NULL,
  `oprtype` smallint(6) NOT NULL,
  `oprreason` char(255) NOT NULL,
  `oprobjtype` char(255) NOT NULL,
  `oprobjid` smallint(6) NOT NULL,
  `oprdate` datetime NOT NULL,
  `note` char(255) NOT NULL default '**',
  PRIMARY KEY  (`prcssid`),
  KEY `process_userid` (`uid`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COMMENT='过程。记录对4个对象的关键操作' AUTO_INCREMENT=119 ;

-- 
-- 导出表中的数据 `ipms_process`
-- 

INSERT INTO `ipms_process` VALUES (1, 4, 2, '审核人', '审1', 1, '提交（撰写人提交材料）', 'patent', 1, '2015-06-01 00:00:00', '**');
INSERT INTO `ipms_process` VALUES (2, 1, 1, '超级管理员', 'admin', 1, '新增（撰写人新增材料）', 'thesis', 1, '2015-06-05 00:00:00', '**');
INSERT INTO `ipms_process` VALUES (3, 1, 1, '超级管理员', 'admin', 1, '新增', 'thesis', 2, '2015-07-01 00:00:00', '**');
INSERT INTO `ipms_process` VALUES (4, 1, 1, '超级管理员', 'admin', 2, '修改', 'thesis', 2, '2015-07-02 00:00:00', '**');
INSERT INTO `ipms_process` VALUES (5, 1, 1, '超级管理员', 'admin', 4, '提交', 'thesis', 2, '2015-07-02 00:00:00', '**');
INSERT INTO `ipms_process` VALUES (6, 4, 2, '审核人', '审1', 5, '审核', 'thesis', 2, '2015-07-04 00:00:00', '**');
INSERT INTO `ipms_process` VALUES (7, 5, 2, '审核人', '批1', 7, '退回', 'thesis', 2, '2015-07-05 00:00:00', '**');
INSERT INTO `ipms_process` VALUES (8, 1, 1, '超级管理员', 'admin', 4, '提交', 'thesis', 2, '2015-07-06 00:00:00', '**');
INSERT INTO `ipms_process` VALUES (9, 4, 2, '审核人', '审1', 5, '审核', 'thesis', 2, '2015-07-06 00:00:00', '**');
INSERT INTO `ipms_process` VALUES (10, 5, 2, '审核人', '批1', 6, '批准', 'thesis', 2, '2015-07-07 00:00:00', '**');
INSERT INTO `ipms_process` VALUES (11, 1, 1, '超级管理员', 'admin', 1, '提交', 'patent', 2, '2015-12-31 00:00:00', '**');
INSERT INTO `ipms_process` VALUES (12, 15, 4, '撰写人', 'hy052', 0, '提交', 'patent', 25, '2016-05-03 01:00:17', '**');
INSERT INTO `ipms_process` VALUES (13, 16, 2, '审核人', 'hy052', 0, '审核', 'patent', 25, '2016-05-03 01:08:17', '++');
INSERT INTO `ipms_process` VALUES (14, 12, 1, '超级管理员', 'clc018', 0, '批准', 'patent', 25, '2016-05-03 01:17:47', '++');
INSERT INTO `ipms_process` VALUES (15, 15, 4, '撰写人', 'hy052', 0, '提交', 'patent', 19, '2016-05-04 23:29:24', '++');
INSERT INTO `ipms_process` VALUES (16, 12, 1, '超级管理员', 'clc018', 0, '审核', 'patent', 9, '2016-05-04 23:52:23', '');
INSERT INTO `ipms_process` VALUES (17, 12, 1, '超级管理员', 'clc018', 0, '提交', 'patent', 19, '2016-05-04 23:54:53', '');
INSERT INTO `ipms_process` VALUES (18, 15, 4, '撰写人', 'hy052', 0, '提交', 'patent', 29, '2016-05-04 23:56:52', '');
INSERT INTO `ipms_process` VALUES (19, 12, 1, '超级管理员', 'clc018', 0, '审核', 'patent', 29, '2016-05-04 23:57:30', '');
INSERT INTO `ipms_process` VALUES (20, 12, 1, '超级管理员', 'clc018', 0, '审核', 'patent', 29, '2016-05-04 23:57:53', '');
INSERT INTO `ipms_process` VALUES (21, 16, 2, '审核人', 'hy052', 0, '修改', 'patent', 19, '2016-05-05 00:26:22', '');
INSERT INTO `ipms_process` VALUES (22, 15, 4, '撰写人', 'hy052', 0, '提交', 'patent', 19, '2016-05-05 00:30:44', '');
INSERT INTO `ipms_process` VALUES (23, 16, 2, '审核人', 'hy052', 0, '审核', 'patent', 19, '2016-05-05 00:31:25', '');
INSERT INTO `ipms_process` VALUES (24, 17, 3, '批准人', 'hy052', 0, '退回', 'patent', 29, '2016-05-05 00:41:08', '退回修改');
INSERT INTO `ipms_process` VALUES (25, 15, 4, '撰写人', 'hy052', 0, '提交', 'patent', 26, '2016-05-05 00:48:24', '');
INSERT INTO `ipms_process` VALUES (26, 16, 2, '审核人', 'hy052', 0, '修改', 'patent', 26, '2016-05-05 00:50:05', '退回修改');
INSERT INTO `ipms_process` VALUES (27, 15, 4, '撰写人', 'hy052', 0, '修改', 'patent', 26, '2016-05-05 00:51:09', '');
INSERT INTO `ipms_process` VALUES (28, 15, 4, '撰写人', 'hy052', 0, '提交', 'patent', 26, '2016-05-05 00:51:48', '提交');
INSERT INTO `ipms_process` VALUES (29, 16, 2, '审核人', 'hy052', 0, '审核', 'patent', 26, '2016-05-05 00:52:07', '审阅通过');
INSERT INTO `ipms_process` VALUES (30, 17, 3, '批准人', 'hy052', 0, '批准', 'patent', 26, '2016-05-05 00:52:53', '批准同意');
INSERT INTO `ipms_process` VALUES (31, 15, 4, ' 撰写人', 'hy052', 0, '提交', 'patent', 24, '2016-05-05 01:02:49', '11111');
INSERT INTO `ipms_process` VALUES (32, 16, 2, '审核人', 'hy052', 0, '修改', 'patent', 24, '2016-05-05 01:04:28', '22323232');
INSERT INTO `ipms_process` VALUES (33, 17, 3, '批准人', 'hy052', 0, '退回', 'patent', 19, '2016-05-05 01:14:22', '退回修改');
INSERT INTO `ipms_process` VALUES (34, 1, 1, '超级管理员', 'admin', 0, '提交', 'patent', 27, '2016-05-05 01:24:22', '提交');
INSERT INTO `ipms_process` VALUES (35, 15, 4, '撰写人', 'hy052', 0, '修改', 'patent', 24, '2016-06-10 23:11:23', '');
INSERT INTO `ipms_process` VALUES (36, 15, 4, '撰写人', 'hy052', 0, '提交', 'patent', 29, '2016-06-10 23:39:38', '提交');
INSERT INTO `ipms_process` VALUES (37, 15, 4, '撰写人', 'hy052', 0, '退回', 'patent', 19, '2016-06-10 23:51:17', '');
INSERT INTO `ipms_process` VALUES (38, 16, 2, '审核人', 'hy052', 0, '修改', 'patent', 29, '2016-07-05 22:33:01', '退回修改');
INSERT INTO `ipms_process` VALUES (39, 15, 4, '撰写人', 'hy052', 0, '填报', 'patent', 31, '2016-07-05 23:13:46', '');
INSERT INTO `ipms_process` VALUES (40, 15, 4, '撰写人', 'hy052', 0, '填报', 'patent', 31, '2016-07-05 23:24:22', '');
INSERT INTO `ipms_process` VALUES (61, 15, 4, '撰写人', 'hy052', 0, '提交', 'patent', 44, '2016-07-17 22:32:38', '**');
INSERT INTO `ipms_process` VALUES (42, 15, 4, '撰写人', 'hy052', 0, '提交', 'patent', 31, '2016-07-05 23:31:48', '**');
INSERT INTO `ipms_process` VALUES (43, 15, 4, '撰写人', 'hy052', 0, '提交', 'patent', 31, '2016-07-05 23:43:30', '**');
INSERT INTO `ipms_process` VALUES (44, 15, 4, '撰写人', 'hy052', 0, '填报', 'patent', 31, '2016-07-05 23:53:09', '**');
INSERT INTO `ipms_process` VALUES (45, 15, 4, '撰写人', 'hy052', 0, '填报', 'patent', 33, '2016-07-05 23:54:49', '');
INSERT INTO `ipms_process` VALUES (46, 15, 4, '撰写人', 'hy052', 0, '填报', 'patent', 0, '2016-07-06 00:18:48', '');
INSERT INTO `ipms_process` VALUES (47, 15, 4, '撰写人', 'hy052', 0, '填报', 'patent', 0, '2016-07-06 00:35:14', '');
INSERT INTO `ipms_process` VALUES (50, 15, 4, '撰写人', 'hy052', 0, '提交', 'patent', 24, '2016-07-17 16:51:57', '**');
INSERT INTO `ipms_process` VALUES (49, 15, 4, '撰写人', 'hy052', 0, '提交', 'patent', 19, '2016-07-17 16:47:33', '提交');
INSERT INTO `ipms_process` VALUES (51, 15, 4, '撰写人', 'hy052', 0, '填报', 'patent', 33, '2016-07-17 16:52:58', '');
INSERT INTO `ipms_process` VALUES (52, 15, 4, '撰写人', 'hy052', 0, '提交', 'patent', 33, '2016-07-17 16:53:09', '**');
INSERT INTO `ipms_process` VALUES (53, 1, 1, '超级管理员', 'admin', 0, '提交', 'patent', 20, '2016-07-17 16:54:55', '**');
INSERT INTO `ipms_process` VALUES (59, 15, 4, '撰写人', 'hy052', 0, '填报', 'patent', 44, '2016-07-17 17:37:44', '**');
INSERT INTO `ipms_process` VALUES (62, 16, 2, '审核人', 'hy052', 0, '修改', 'patent', 44, '2016-07-17 22:35:50', '退回修改');
INSERT INTO `ipms_process` VALUES (63, 16, 2, '审核人', 'hy052', 0, '修改', 'patent', 33, '2016-07-17 22:38:02', '退回修改');
INSERT INTO `ipms_process` VALUES (64, 17, 3, '批准人', 'hy052', 0, '退回', 'patent', 9, '2016-07-18 21:48:08', '**');
INSERT INTO `ipms_process` VALUES (65, 15, 4, '撰写人', 'hy052', 0, '提交', 'patent', 30, '2016-07-18 21:49:30', '提交待审');
INSERT INTO `ipms_process` VALUES (66, 15, 4, '撰写人', 'hy052', 0, '提交', 'patent', 29, '2016-07-19 23:20:06', '**');
INSERT INTO `ipms_process` VALUES (67, 15, 4, '撰写人', 'hy052', 0, '提交', 'patent', 44, '2016-07-24 22:31:34', '提交审核');
INSERT INTO `ipms_process` VALUES (68, 16, 2, '审核人', 'hy052', 0, '退回', 'patent', 44, '2016-07-24 22:36:01', '退回修改');
INSERT INTO `ipms_process` VALUES (69, 15, 4, '撰写人', 'hy052', 0, '提交', 'patent', 44, '2016-07-24 23:01:57', '提交审核');
INSERT INTO `ipms_process` VALUES (70, 15, 4, '撰写人', 'hy052', 0, '填报', 'patent', 63, '2016-07-29 11:14:02', '');
INSERT INTO `ipms_process` VALUES (71, 15, 4, '撰写人', 'hy052', 0, '填报', 'patent', 64, '2016-08-05 16:58:45', '');
INSERT INTO `ipms_process` VALUES (72, 15, 4, '撰写人', 'hy052', 0, '提交', 'patent', 63, '2016-08-05 17:14:14', '提交审核');
INSERT INTO `ipms_process` VALUES (73, 15, 4, '撰写人', 'hy052', 0, '提交', 'patent', 64, '2016-08-05 17:14:24', '提交审核');
INSERT INTO `ipms_process` VALUES (74, 20, 2, '审核人', 'clc018', 0, '退回', 'patent', 63, '2016-08-05 17:15:44', '**');
INSERT INTO `ipms_process` VALUES (75, 20, 2, '审核人', 'clc018', 0, '退回', 'patent', 64, '2016-08-05 17:16:36', '退回');
INSERT INTO `ipms_process` VALUES (76, 15, 4, '撰写人', 'hy052', 0, '提交', 'patent', 63, '2016-08-05 17:18:02', '提交审核');
INSERT INTO `ipms_process` VALUES (77, 15, 4, '撰写人', 'hy052', 0, '提交', 'patent', 64, '2016-08-05 17:18:17', '提交审核');
INSERT INTO `ipms_process` VALUES (78, 20, 2, '审核人', 'clc018', 0, '退回', 'patent', 63, '2016-08-05 17:18:52', '没有附件，退回');
INSERT INTO `ipms_process` VALUES (79, 20, 2, '审核人', 'clc018', 0, '审核同意', 'patent', 64, '2016-08-05 17:19:04', '**');
INSERT INTO `ipms_process` VALUES (80, 24, 3, '批准人', 'qxy112', 0, '退回', 'patent', 64, '2016-08-05 17:19:46', '退回修改');
INSERT INTO `ipms_process` VALUES (81, 15, 4, '撰写人', 'hy052', 0, '提交', 'patent', 64, '2016-08-05 17:20:51', '提交审核');
INSERT INTO `ipms_process` VALUES (82, 14, 4, '撰写人', 'qxy112', 0, '填报', 'patent', 65, '2016-08-05 17:58:16', '');
INSERT INTO `ipms_process` VALUES (83, 15, 4, '撰写人', 'hy052', 0, '填报', 'patent', 66, '2016-08-05 18:44:57', '');
INSERT INTO `ipms_process` VALUES (84, 15, 4, '撰写人', 'hy052', 0, '填报', '', 67, '2016-09-02 11:19:39', '');
INSERT INTO `ipms_process` VALUES (85, 15, 4, '撰写人', 'hy052', 0, '填报', '', 68, '2016-09-02 11:24:12', '');
INSERT INTO `ipms_process` VALUES (86, 15, 4, '撰写人', 'hy052', 0, '提交', 'patent', 66, '2016-09-02 11:26:46', '**');
INSERT INTO `ipms_process` VALUES (87, 15, 4, '撰写人', 'hy052', 0, '填报', 'patent', 69, '2016-09-02 11:30:53', '**');
INSERT INTO `ipms_process` VALUES (88, 15, 4, '撰写人', 'hy052', 0, '填报', 'patent', 70, '2016-09-02 11:40:58', '**');
INSERT INTO `ipms_process` VALUES (89, 15, 4, '撰写人', 'hy052', 0, '提交', 'patent', 70, '2016-09-02 11:41:17', '');
INSERT INTO `ipms_process` VALUES (90, 15, 4, '撰写人', 'hy052', 0, '修改', 'patent', 65, '2016-09-02 11:48:59', '');
INSERT INTO `ipms_process` VALUES (91, 16, 2, '审核人', 'hy052', 0, '退回', 'patent', 66, '2016-09-02 13:57:58', '**');
INSERT INTO `ipms_process` VALUES (92, 15, 4, '撰写人', 'hy052', 0, '修改', 'patent', 66, '2016-09-02 13:59:20', '');
INSERT INTO `ipms_process` VALUES (93, 15, 4, '撰写人', 'hy052', 0, '提交', 'patent', 66, '2016-09-02 13:59:34', '**');
INSERT INTO `ipms_process` VALUES (94, 16, 2, '审核人', 'hy052', 0, '审核同意', 'patent', 66, '2016-09-02 14:00:53', '**');
INSERT INTO `ipms_process` VALUES (95, 17, 3, '批准人', 'hy052', 0, '退回', 'patent', 66, '2016-09-02 14:01:32', '**');
INSERT INTO `ipms_process` VALUES (96, 18, 7, '维护人', 'hy052', 0, '更新', 'patent', 35, '2016-09-02 14:08:34', '专利申请被驳回');
INSERT INTO `ipms_process` VALUES (97, 18, 7, '维护人', 'hy052', 0, '更新', 'patent', 35, '2016-09-02 14:12:42', '**');
INSERT INTO `ipms_process` VALUES (98, 18, 7, '维护人', 'hy052', 0, '更新', 'patent', 45, '2016-09-02 14:14:00', '专利申请被驳回');
INSERT INTO `ipms_process` VALUES (99, 16, 2, '审核人', 'hy052', 0, '审核同意', 'patent', 63, '2016-09-02 14:17:19', '**');
INSERT INTO `ipms_process` VALUES (100, 17, 3, '批准人', 'hy052', 0, '批准同意', 'patent', 63, '2016-09-02 14:17:46', '**');
INSERT INTO `ipms_process` VALUES (101, 18, 7, '维护人', 'hy052', 0, '更新', 'patent', 34, '2016-09-02 14:20:11', '专利已授权');
INSERT INTO `ipms_process` VALUES (102, 18, 7, '维护人', 'hy052', 0, '更新', 'patent', 63, '2016-09-02 14:22:10', '提交专利代理申报');
INSERT INTO `ipms_process` VALUES (103, 18, 7, '维护人', 'hy052', 0, '更新', 'patent', 25, '2016-09-02 20:00:56', '专利续费维护');
INSERT INTO `ipms_process` VALUES (104, 18, 7, '维护人', 'hy052', 0, '更新', 'patent', 63, '2016-09-05 10:29:54', '提交专利代理申报');
INSERT INTO `ipms_process` VALUES (105, 18, 7, '维护人', 'hy052', 0, '更新', 'patent', 34, '2016-09-05 10:33:13', '**');
INSERT INTO `ipms_process` VALUES (106, 18, 7, '维护人', 'hy052', 0, '更新', 'patent', 34, '2016-09-05 10:34:20', '**');
INSERT INTO `ipms_process` VALUES (107, 15, 4, '撰写人', 'hy052', 0, '提交', 'patent', 67, '2016-09-05 10:41:34', '**');
INSERT INTO `ipms_process` VALUES (108, 16, 2, '审核人', 'hy052', 0, '审核同意', 'patent', 67, '2016-09-05 10:43:22', '**');
INSERT INTO `ipms_process` VALUES (109, 17, 3, '批准人', 'hy052', 0, '批准同意', 'patent', 67, '2016-09-05 10:49:15', '批准同意');
INSERT INTO `ipms_process` VALUES (110, 15, 4, '撰写人', 'hy052', 0, '提交', 'patent', 66, '2016-09-05 10:50:12', '**');
INSERT INTO `ipms_process` VALUES (111, 16, 2, '审核人', 'hy052', 0, '审核同意', 'patent', 66, '2016-09-05 10:53:36', '专利申请被驳回');
INSERT INTO `ipms_process` VALUES (112, 17, 3, '批准人', 'hy052', 0, '退回', 'patent', 66, '2016-09-05 10:54:51', '专利申请被驳回');
INSERT INTO `ipms_process` VALUES (113, 18, 7, '维护人', 'hy052', 0, '更新', 'patent', 67, '2016-09-05 10:56:23', '不合格');
INSERT INTO `ipms_process` VALUES (114, 18, 7, '维护人', 'hy052', 0, '更新', 'patent', 57, '2016-09-05 11:20:53', '专利续费维护');
INSERT INTO `ipms_process` VALUES (115, 18, 7, '维护人', 'hy052', 0, '更新', 'patent', 56, '2016-09-05 11:21:30', '专利续费维护');
INSERT INTO `ipms_process` VALUES (116, 18, 7, '维护人', 'hy052', 0, '更新', 'thesis', 2, '2016-09-05 13:56:45', '论文投稿出版方');
INSERT INTO `ipms_process` VALUES (117, 15, 4, '撰写人', 'hy052', 0, '填报', '', 71, '2016-09-07 09:59:05', '');
INSERT INTO `ipms_process` VALUES (118, 15, 4, '撰写人', 'hy052', 0, '提交', 'patent', 68, '2016-09-18 16:09:58', '提交审核');

-- --------------------------------------------------------

-- 
-- 表的结构 `ipms_thesis`
-- 

DROP TABLE IF EXISTS `ipms_thesis`;
CREATE TABLE IF NOT EXISTS `ipms_thesis` (
  `the_id` smallint(6) NOT NULL auto_increment,
  `thetopic` char(255) default NULL,
  `thetype` char(255) default NULL,
  `status` char(255) default NULL,
  `pubname` char(255) default NULL,
  `pubdetail` char(255) default NULL,
  `pubcore` tinyint(1) NOT NULL COMMENT '是否为核心期刊',
  `pubcode` char(255) NOT NULL default '****' COMMENT 'ISBN,ISSN/CN',
  `applynumber` char(255) default NULL COMMENT '院内编号',
  `adddate` date NOT NULL default '0000-00-00' COMMENT '院内填报日期',
  `submitdate` date NOT NULL default '0000-00-00' COMMENT '院内提交日期',
  `mod_retdate` date NOT NULL default '0000-00-00' COMMENT '修改/退回日期',
  `auditdate` date NOT NULL default '0000-00-00' COMMENT '院内审核日期',
  `approvedate` date NOT NULL default '0000-00-00' COMMENT '院内批准日期',
  `cntrdate` date NOT NULL default '0000-00-00' COMMENT '投稿日期',
  `incl_rejdate` date NOT NULL default '0000-00-00' COMMENT '收录/拒稿日期',
  `pubdate` date NOT NULL default '0000-00-00' COMMENT '发表日期',
  `uid` smallint(6) default NULL,
  `writer` char(255) NOT NULL default '*' COMMENT '撰写人',
  `author1st` char(255) NOT NULL default '*' COMMENT '第一作者',
  `author2nd` char(255) NOT NULL default '*' COMMENT '第二作者',
  `authorother` char(255) NOT NULL default '*' COMMENT '其他作者',
  `dept` char(255) default NULL,
  `keyword` char(255) default NULL,
  `summary` text,
  `prjnum` varchar(255) default NULL,
  `prjtopic` varchar(255) default NULL,
  `attachment` text,
  PRIMARY KEY  (`the_id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COMMENT='论文' AUTO_INCREMENT=9 ;

-- 
-- 导出表中的数据 `ipms_thesis`
-- 

INSERT INTO `ipms_thesis` VALUES (1, 'LED照明', '期刊(国内非核心)论文', '出版', '应用光学', '期刊', 0, '****', '222', '0000-00-00', '2016-01-04', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', 3, '写2', '写2', '写1', '审1', '光机电', '照明控制', '自动化照明控制。', 'XM2015011', '自动控制与照明设计', NULL);
INSERT INTO `ipms_thesis` VALUES (2, '浅谈LED健康照明', '期刊(国内非核心)论文', '批准', '《探索科学》', '《探索科学》2016年04期', 0, '无', 'LW2016002', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '2016-04-15', '0000-00-00', '0000-00-00', '0000-00-00', 0, '林琦', '林琦', '林镇杰', '冯严霄、何明佳、王巧彬', 'JC2', '无', '无', '无', '《广州市健康照明重点实验室》', '无');
INSERT INTO `ipms_thesis` VALUES (3, '一种智能LED照明系统设计', '期刊(国内核心)论文', '批准', '山西电子技术', '无', 0, '无', 'LW2016003', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '2016-05-30', '0000-00-00', '0000-00-00', '0000-00-00', 0, '何晓波', '何晓波', '陈龙', '潘俊锋', 'RD1', '无', '无', '无', '《广州市健康照明重点实验室》、《农业生产用智慧型LED组合光源控制系统关键技术研究与推广》', '无');
INSERT INTO `ipms_thesis` VALUES (4, '多段自由曲面透镜的设计方法', '期刊(国内核心)论文', '批准', '应用光学', '无', 0, '无', 'LW2016004', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', 0, '何志宏', '何志宏', '曹婧', '宋杰', 'RD3', '无', '无', '无', '《广州市健康照明重点实验室》\n、《标准光组件检测实验室能力与产品品质保障服务体系建设》', '无');
INSERT INTO `ipms_thesis` VALUES (5, '基于MVC和实体框架的道路智能管理系统', '期刊(国内核心)论文', '批准', '计算机与现代化', '《计算机与现代化》2015年第10期', 0, '无', 'LW2015001', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '2015-02-15', '0000-00-00', '0000-00-00', '0000-00-00', 0, '刘宇', '刘宇', '蔡俊涛', '赖顺桥、肖熠琳', '无', '无', '无', '无', '1、城市快速路智能化半导体照明关键技术研发及示范\n2、基于云计算的城市LED照明网管理服务平台', '无');
INSERT INTO `ipms_thesis` VALUES (6, '摄像机检测平台的系统开发', '期刊(国内核心)论文', '批准', '机电信息', '修改后再审核，暂不发表\n《机电工程技术》2015年第44卷第06期', 0, '无', 'LW2015002', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', 0, '胡锦添', '胡锦添', '蔡俊涛', '刘蓝轩', '无', '无', '无', '无', '无', '无');
INSERT INTO `ipms_thesis` VALUES (7, '55', '期刊(国内非核心)论文', '填报', '55', '55', 0, '55', NULL, '2016-08-29', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', 15, 'hy052', 'hy052', '55', '55', '计划部', '55', '55', 'XM2015053', '55', NULL);
INSERT INTO `ipms_thesis` VALUES (8, '材料对电子标签读取性能影响的研究', '期刊(国内核心)论文', '批准', '自动化与信息工程', '《科学与财富》2016第8卷6月刊', 0, '无', 'LW2016001', '0000-00-00', '0000-00-00', '0000-00-00', '0000-00-00', '2016-01-16', '0000-00-00', '0000-00-00', '0000-00-00', 0, '林镇杰', '林镇杰', '胡毅帆', '林琦', 'JC1', '无', '无', '无', '《无线传感器网络性能评估系统研发》、《检测实验室信息化集成开发能力建设》', '无');

-- --------------------------------------------------------

-- 
-- 表的结构 `ipms_usergroup`
-- 

DROP TABLE IF EXISTS `ipms_usergroup`;
CREATE TABLE IF NOT EXISTS `ipms_usergroup` (
  `groupid` smallint(6) NOT NULL auto_increment,
  `groupname` char(255) default NULL,
  `groupdes` char(255) default NULL,
  `authorityadd` tinyint(1) default NULL,
  `authoritymod` tinyint(1) default NULL,
  `authoritysub` tinyint(1) default NULL,
  `authorityaud` tinyint(1) default NULL,
  `authorityapp` tinyint(1) default NULL,
  `authorityret` tinyint(1) default NULL,
  `maintain` tinyint(1) NOT NULL default '0' COMMENT '维护管理',
  `useradmin` tinyint(1) NOT NULL default '0',
  PRIMARY KEY  (`groupid`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COMMENT='用户组' AUTO_INCREMENT=8 ;

-- 
-- 导出表中的数据 `ipms_usergroup`
-- 

INSERT INTO `ipms_usergroup` VALUES (4, '撰写人', ' 材料撰写人', 1, 1, 1, 0, 0, 0, 0, 0);
INSERT INTO `ipms_usergroup` VALUES (2, '审核人', '审核撰写人提交的材料', 0, 0, 0, 1, 0, 1, 0, 0);
INSERT INTO `ipms_usergroup` VALUES (3, '批准人', '批准经审核人审核通过的材料', 0, 1, 0, 0, 1, 1, 0, 0);
INSERT INTO `ipms_usergroup` VALUES (1, '超级管理员', '超级管理员用户组，该组的用户具有全部的权限', 1, 1, 1, 1, 1, 1, 0, 1);
INSERT INTO `ipms_usergroup` VALUES (6, '111', '1115', 1, 1, 0, 0, 0, 0, 0, 0);
INSERT INTO `ipms_usergroup` VALUES (7, '维护人', '对批准后的知识产权进行维护、管理', 0, 0, 0, 0, 0, 0, 1, 0);
